robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
    BootDisplay_ClearLine(row0);
    BootDisplay_ClearLine(row1);
    BootDisplay_ClearLine(row2);
    BootDisplay_WriteLineColor(row0, line0, color);
    if ((line1 != NULL) && (line1[0] != '\0'))
    {
        BootDisplay_WriteLineColor(row1, line1, color);
    }

    for (elapsed = 0U; elapsed <= duration; elapsed++)
    {
        uint32_t remaining = duration - elapsed;
        uint32_t percent = (elapsed * 100U) / duration;
        uint32_t filled = 10U - (percent / 10U);

        for (i = 0U; i < 10U; i++)
        {
            bar[i] = (i < filled) ? '#' : '.';
        }
        bar[10] = '\0';

        (void)snprintf(line, sizeof(line), "[%s] %2lus",
                       bar,
                       (unsigned long)remaining);
        BootDisplay_WriteLineColor(row2, line, color);

        if (elapsed < duration)
        {
            HAL_Delay(1000U);
        }
    }
}

static void Boot_ShowApplicationLaunchCountdown(void)
{
    BootDisplay_LogColor("UPDATE COMPLETE", BOOT_DISPLAY_COLOR_GREEN);
    BootDisplay_ClearProgress();
    Boot_ShowCountdown(28U,
                       "STARTING APPLICATION...",
                       29U,
                       "",
                       29U,
                       BOOT_DISPLAY_COLOR_YELLOW);

    BootDisplay_ClearProgress();
    BootDisplay_LogColor("STARTING APPLICATION...", BOOT_DISPLAY_COLOR_GREEN);
}

static void Boot_ShowProgrammingCountdown(const char *ver_line, const char *build_date)
{
    BootDisplay_ClearLine(26U);
    BootDisplay_WriteLineColor(26U, ver_line, BOOT_DISPLAY_COLOR_YELLOW);
    BootDisplay_ClearLine(27U);
    BootDisplay_WriteLineColor(27U, build_date, BOOT_DISPLAY_COLOR_YELLOW);
    Boot_ShowCountdown(25U,
                       "PROGRAMMING STARTS IN 15s",
                       28U,
                       "POWER OFF & REMOVE USB TO SKIP",
                       29U,
                       BOOT_DISPLAY_COLOR_YELLOW);
    BootDisplay_ClearLine(25U);
    BootDisplay_ClearLine(26U);
    BootDisplay_ClearLine(27U);
    BootDisplay_ClearLine(28U);
    BootDisplay_ClearLine(29U);
}

static void BootDisplay_FlashEraseProgress(uint32_t current, uint32_t total)
{
    BootDisplay_ShowProgress("ERASING INT FLASH...", current, total);
}

static void BootDisplay_OspiEraseProgress(uint32_t current, uint32_t total)
{
    BootDisplay_ShowProgress("ERASING OSPI FLASH...", current, total);
}

/* -----------------------------------------------------------------------
 * USB read helper: read a chunk with full USB restart recovery on failure.
 * ----------------------------------------------------------------------- */
static UsbFsResult_t UsbReadChunkWithRecovery(const char *path,
                                               uint8_t *buf,
                                               uint32_t offset,
                                               uint32_t to_read,
                                               uint32_t *bytes_read,
                                               const char *tag)
{
    UsbFsResult_t result;
    uint32_t retry;

    *bytes_read = 0U;
    for (retry = 0U; retry <= CHUNKED_READ_MAX_RETRIES; retry++)
    {
        result = UsbFsService_ReadFile(path, buf, offset, to_read, bytes_read);
        if (result == USB_FS_RESULT_OK)
        {
            return USB_FS_RESULT_OK;
        }
        if (retry < CHUNKED_READ_MAX_RETRIES)
        {
            printf("[%s] read offset=%lu RETRY %lu/%u -> recovery\n",
                   tag,
                   (unsigned long)offset,
                   (unsigned long)(retry + 1U),
                   (unsigned int)CHUNKED_READ_MAX_RETRIES);

            UsbFsService_Unmount();
            UsbMscService_ForceRestart();
            {
                uint32_t t_wait = HAL_GetTick();
                while (UsbMscService_IsReady() == 0U)
                {
                    UsbMscService_Process();
                    if ((HAL_GetTick() - t_wait) > 10000U)
                    {
                        printf("[%s] recovery timeout\n", tag);
                        break;
                    }
                }
            }
            if (UsbMscService_IsReady() != 0U)
            {
                (void)UsbFsService_Mount();
            }
        }
    }

    return result;
}

/* -----------------------------------------------------------------------
 * main
 * ----------------------------------------------------------------------- */
int main(void)
{
    HAL_Init();
    __HAL_RCC_PWR_CLK_ENABLE();
    SystemPower_Config();
    /* Voltage scaling is handled inside SystemClock_Config (scale 1,
       required for 160 MHz). */
    SystemClock_Config();

    /* Instruction cache (1-way, mirroring the application project).
       Essential at 160 MHz with FLASH_LATENCY_4: without it every
       instruction fetch pays the full flash latency — measured impact:
       the software CRC32+SHA-256 pre-check ran at ~2.5 s/MB of pure CPU
       time, dominating the USB verification pass. */
    if (HAL_ICACHE_ConfigAssociativityMode(ICACHE_1WAY) != HAL_OK)
    {
        Error_Handler();
    }
    if (HAL_ICACHE_Enable() != HAL_OK)
    {
        Error_Handler();
    }

    MX_GPIO_Init();

    printf("BL start\n");
    Boot_SelectBootPath();

    while (1) {}
}

/* -----------------------------------------------------------------------
 * Recovery_Loop
 * ----------------------------------------------------------------------- */
static void Recovery_Loop(void)
{
    uint32_t last_blink = HAL_GetTick();

    BootDisplay_EnsureInit();
    BootDisplay_Log("RECOVERY MODE");
    BootDisplay_LogColor("NO VALID APP", BOOT_DISPLAY_COLOR_RED);
    BootDisplay_Log("");
    BootDisplay_LogColor("INSERT UPDATE USB", BOOT_DISPLAY_COLOR_YELLOW);
    BootDisplay_LogColor("AND REBOOT", BOOT_DISPLAY_COLOR_YELLOW);

    while (1)
    {
        if ((HAL_GetTick() - last_blink) >= 250U)
        {
            last_blink = HAL_GetTick();
            HAL_GPIO_TogglePin(BOOT_LED_GPIO_Port, BOOT_LED_Pin);
        }
    }
}

/* -----------------------------------------------------------------------
 * Boot_SelectBootPath
 * ----------------------------------------------------------------------- */
static void Boot_SelectBootPath(void)
{
#if BOOT_USB_UPDATE_ENABLED
    if (UsbBootCheck(BOOT_USB_DETECT_TIMEOUT_MS, BOOT_USB_READY_TIMEOUT_MS) != 0U)
    {
        if (UsbProcessUpdate() != 0U)
        {
            return;
        }
        /* UPDATE directory not found on USB — fall through to normal boot */
    }
#endif

    Boot_SelectAppOrRecovery();
}

/* -----------------------------------------------------------------------
 * Boot_SelectAppOrRecovery
 * ----------------------------------------------------------------------- */
static void Boot_SelectAppOrRecovery(void)
{
    uint8_t app_valid = (uint8_t)Boot_IsApplicationValid(APP_BASE);

