robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
#if BOOT_FORCE_INVALID_APP_FOR_TEST
    printf("[BOOT] TEST MODE: forcing application invalid\n");
    app_valid = 0U;
#endif

    if (app_valid != 0U)
    {
        if (Boot_VerifyAppCrc() == 0)
        {
            app_valid = 0U;
        }
    }

    if (app_valid != 0U)
    {
        UsbFsService_Unmount();
        UsbMscService_SetEnabled(0U);
        HAL_Delay(50U);
        Boot_JumpToApplication(APP_BASE);
    }

    BootDisplay_EnsureInit();
    printf("[BOOT] Recovery mode\n");
    Recovery_Loop();
}

/* -----------------------------------------------------------------------
 * FlashAppInt — Read app_int.bin from USB, program internal flash, verify.
 * ----------------------------------------------------------------------- */
static void FlashAppInt(uint32_t expected_crc32)
{
    uint8_t * const chunk = io_buf;
    UsbFsResult_t  result;
    BootFlashResult_t flash_result;
    uint32_t       file_size = 0U;
    uint32_t       offset    = 0U;
    uint32_t       bytes_read;
    uint32_t       to_read;
    uint32_t       t_start;

    printf("[FLASH] === app_int.bin -> internal flash ===\n");
    BootDisplay_LogColor("INT FLASH UPDATE", BOOT_DISPLAY_COLOR_BLUE);

    /* Preparation: resolve input file size before touching flash. */
    result = UsbFsService_GetFileSize(USB_UPDATE_APP_INT_BIN, &file_size);
    if (result != USB_FS_RESULT_OK)
    {
        BootDisplay_Fail("INT FLASH FILE ERROR", 0U);
        printf("[FLASH] GetFileSize FAILED result=%u\n", (unsigned int)result);
        return;
    }
    printf("[FLASH] file size=%lu bytes\n", (unsigned long)file_size);

    /* Erase phase. */
    printf("[FLASH] erasing...\n");
    BootDisplay_ShowProgress("ERASING INT FLASH...", 0U, 1U);
    flash_result = BootFlash_EraseAppArea(file_size, BootDisplay_FlashEraseProgress);
    if (flash_result != BOOT_FLASH_OK)
    {
        BootDisplay_Fail("INT FLASH ERASE FAILED", 1U);
        printf("[FLASH] erase FAILED result=%u\n", (unsigned int)flash_result);
        return;
    }

    /* Write phase. */
    printf("[FLASH] programming...\n");
    BootDisplay_Log("INT FLASH ERASE DONE");
    BootDisplay_Log("WRITING INT FLASH...");
    BootDisplay_ClearProgress();
    BootDisplay_ShowProgress("WRITING INT FLASH...", 0U, file_size);
    t_start = HAL_GetTick();

    while (offset < file_size)
    {
        to_read = file_size - offset;
        if (to_read > CHUNKED_READ_BLOCK_SIZE)
        {
            to_read = CHUNKED_READ_BLOCK_SIZE;
        }

        result = UsbReadChunkWithRecovery(USB_UPDATE_APP_INT_BIN, chunk,
                                          offset, to_read, &bytes_read, "FLASH");
        if (result != USB_FS_RESULT_OK)
        {
            BootDisplay_Fail("INT FLASH READ FAILED", 1U);
            printf("[FLASH] read FAILED at offset=%lu\n", (unsigned long)offset);
            return;
        }

        /* Program and verify in 64KB sub-blocks so the display can refresh. */
        {
            uint32_t sub_off = 0U;
            while (sub_off < bytes_read)
            {
                uint32_t sub_len = bytes_read - sub_off;
                if (sub_len > 65536U)
                {
                    sub_len = 65536U;
                }

                flash_result = BootFlash_Program(APP_BASE + offset + sub_off,
                                                 &chunk[sub_off], sub_len);
                if (flash_result != BOOT_FLASH_OK)
                {
                    BootDisplay_Fail("INT FLASH WRITE FAILED", 1U);
                    printf("[FLASH] program FAILED at offset=%lu result=%u\n",
                           (unsigned long)(offset + sub_off), (unsigned int)flash_result);
                    return;
                }

                flash_result = BootFlash_Verify(APP_BASE + offset + sub_off,
                                                &chunk[sub_off], sub_len);
                if (flash_result != BOOT_FLASH_OK)
                {
                    BootDisplay_Fail("INT FLASH VERIFY FAILED", 1U);
                    printf("[FLASH] verify FAILED at offset=%lu\n",
                           (unsigned long)(offset + sub_off));
                    return;
                }

                sub_off += sub_len;
                BootDisplay_UpdateProgress("WRITING INT FLASH...",
                                           offset + sub_off, file_size);
                HAL_Delay(20U);
            }
        }

        offset += bytes_read;

        printf("[FLASH] %lu / %lu bytes (%lu%%)\n",
               (unsigned long)offset,
               (unsigned long)file_size,
               (unsigned long)((offset * 100U) / file_size));

    }

    /* Verify phase. */
    BootDisplay_Log("INT FLASH WRITE DONE");
    BootDisplay_Log("VERIFYING INT FLASH...");
    BootDisplay_ClearProgress();
    {
        uint32_t crc_flash = BootCrc32_Compute(0U, (const uint8_t *)APP_BASE, file_size);
        BootDisplay_LogColor((crc_flash == expected_crc32) ? "INT FLASH CRC OK" : "INT FLASH CRC FAIL",
                             (crc_flash == expected_crc32) ? BOOT_DISPLAY_COLOR_NORMAL : BOOT_DISPLAY_COLOR_RED);

        printf("[FLASH] CRC32=%08lX  expected=%08lX  %s\n",
               (unsigned long)crc_flash,
               (unsigned long)expected_crc32,
               (crc_flash == expected_crc32) ? "MATCH" : "MISMATCH");
    }

    /* Final state. */
    printf("[FLASH] Boot_IsApplicationValid: %s\n",
           Boot_IsApplicationValid(APP_BASE) ? "VALID" : "INVALID");

    printf("[FLASH] done in %lu ms\n", (unsigned long)(HAL_GetTick() - t_start));
}

/* -----------------------------------------------------------------------
 * FlashAppOspi — Read app_ospi.bin from USB, program OSPI flash, verify,
 *                re-enable memory-mapped mode and decide final app state.
 * ----------------------------------------------------------------------- */
static void FlashAppOspi(uint32_t expected_crc32,
                         uint32_t int_crc32, uint32_t int_size,
                         uint32_t ospi_size)
{
    uint8_t * const chunk = io_buf;
    UsbFsResult_t  result;
    BootOspiResult_t ospi_result;
    uint32_t       file_size = 0U;
    uint32_t       offset    = 0U;
    uint32_t       bytes_read;
    uint32_t       to_read;
    uint32_t       t_start;

