robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
    printf("[OSPI] === app_ospi.bin -> OSPI flash ===\n");
    BootDisplay_LogColor("OSPI FLASH UPDATE", BOOT_DISPLAY_COLOR_BLUE);
    BootDisplay_Log("INITIALIZING OSPI...");

    /* Preparation: initialize OSPI and resolve input file size. */
    ospi_result = BootOspi_Init();
    if (ospi_result != BOOT_OSPI_OK)
    {
        BootDisplay_Fail("OSPI INIT FAILED", 0U);
        printf("[OSPI] init FAILED result=%u\n", (unsigned int)ospi_result);
        return;
    }

    result = UsbFsService_GetFileSize(USB_UPDATE_APP_OSPI_BIN, &file_size);
    if (result != USB_FS_RESULT_OK)
    {
        BootDisplay_Fail("OSPI FILE ERROR", 0U);
        printf("[OSPI] GetFileSize FAILED result=%u\n", (unsigned int)result);
        return;
    }
    printf("[OSPI] file size=%lu bytes\n", (unsigned long)file_size);

    /* Erase phase. */
    printf("[OSPI] erasing...\n");
    BootDisplay_ShowProgress("ERASING OSPI FLASH...", 0U, 1U);
    ospi_result = BootOspi_Erase(file_size, BootDisplay_OspiEraseProgress);
    if (ospi_result != BOOT_OSPI_OK)
    {
        BootDisplay_Fail("OSPI FLASH ERASE FAILED", 1U);
        printf("[OSPI] erase FAILED result=%u\n", (unsigned int)ospi_result);
        return;
    }

    /* Write phase. */
    printf("[OSPI] programming...\n");
    BootDisplay_Log("OSPI FLASH ERASE DONE");
    BootDisplay_Log("WRITING OSPI FLASH...");
    BootDisplay_ClearProgress();
    BootDisplay_ShowProgress("WRITING OSPI FLASH...", 0U, file_size);
    t_start = HAL_GetTick();

    while (offset < file_size)
    {
        to_read = file_size - offset;
        if (to_read > CHUNKED_READ_BLOCK_SIZE)
        {
            to_read = CHUNKED_READ_BLOCK_SIZE;
        }

        result = UsbReadChunkWithRecovery(USB_UPDATE_APP_OSPI_BIN, chunk,
                                          offset, to_read, &bytes_read, "OSPI");
        if (result != USB_FS_RESULT_OK)
        {
            BootDisplay_Fail("OSPI READ FAILED", 1U);
            printf("[OSPI] read FAILED at offset=%lu\n", (unsigned long)offset);
            return;
        }

        ospi_result = BootOspi_Program(offset, chunk, bytes_read);
        if (ospi_result != BOOT_OSPI_OK)
        {
            BootDisplay_Fail("OSPI FLASH WRITE FAILED", 1U);
            printf("[OSPI] program FAILED at offset=%lu result=%u\n",
                   (unsigned long)offset, (unsigned int)ospi_result);
            return;
        }

        offset += bytes_read;
        BootDisplay_UpdateProgress("WRITING OSPI FLASH...", offset, file_size);

        printf("[OSPI] %lu / %lu bytes (%lu%%) t=%lums\n",
               (unsigned long)offset,
               (unsigned long)file_size,
               (unsigned long)((offset * 100U) / file_size),
               (unsigned long)HAL_GetTick());

    }

    uint32_t elapsed = HAL_GetTick() - t_start;

    /* Verify phase: switch to memory-mapped mode and compute CRC32. */
    if (BootOspi_EnableMemoryMapped() != BOOT_OSPI_OK)
    {
        BootDisplay_Fail("OSPI VERIFY FAILED", 1U);
        printf("[OSPI] memory-mapped FAILED, cannot verify\n");
        return;
    }

    {
        uint32_t crc_flash;
        uint32_t t_crc = HAL_GetTick();

        printf("[OSPI] verifying CRC32 over memory-mapped OSPI...\n");
        BootDisplay_Log("OSPI FLASH WRITE DONE");
        BootDisplay_Log("VERIFYING OSPI FLASH...");
        BootDisplay_ClearProgress();
        BootDisplay_ShowProgress("VERIFYING OSPI FLASH...", 0U, file_size);

        /* CRC could be computed in one call, but chunking in 64KB lets
         * the LTDC refresh the progress bar between iterations. */
        {
            uint32_t crc_off = 0U;
            crc_flash = 0U;
            while (crc_off < file_size)
            {
                uint32_t crc_len = file_size - crc_off;
                if (crc_len > 65536U)
                {
                    crc_len = 65536U;
                }
                crc_flash = BootCrc32_Compute(crc_flash,
                                              (const uint8_t *)(OCTOSPI1_BASE + crc_off),
                                              crc_len);
                crc_off += crc_len;
                BootDisplay_UpdateProgress("VERIFYING OSPI FLASH...",
                                           crc_off, file_size);
                HAL_Delay(20U);
            }
        }

        /* Re-establish memory-mapped for app, then deinit CRC */
        HAL_OSPI_Abort(BootOspi_GetHandle());
        if (BootOspi_EnableMemoryMapped() != BOOT_OSPI_OK)
        {
            BootDisplay_Fail("OSPI VERIFY FAILED", 0U);
            printf("[OSPI] re-enable memory-mapped FAILED\n");
        }
        BootCrc32_DeInit();

        printf("[OSPI] CRC32=%08lX  expected=%08lX  %s  (%lu ms)\n",
               (unsigned long)crc_flash,
               (unsigned long)expected_crc32,
               (crc_flash == expected_crc32) ? "MATCH" : "MISMATCH",
               (unsigned long)(HAL_GetTick() - t_crc));
        BootDisplay_ShowProgress("VERIFYING OSPI FLASH...", 1U, 1U);
        BootDisplay_LogColor((crc_flash == expected_crc32) ? "OSPI FLASH CRC OK" : "OSPI FLASH CRC FAIL",
                             (crc_flash == expected_crc32) ? BOOT_DISPLAY_COLOR_NORMAL : BOOT_DISPLAY_COLOR_RED);
    }

    /* Final state. */
    printf("[OSPI] done in %lu ms\n", (unsigned long)elapsed);

    /* Final state: jump only if the resulting application is valid. */
    if (Boot_IsApplicationValid(APP_BASE))
    {
        Boot_StoreAppCrc(int_crc32, int_size, expected_crc32, ospi_size);
        Boot_ShowApplicationLaunchCountdown();
        printf("[BOOT] app valid -> jumping...\n");
        UsbFsService_Unmount();
        UsbMscService_SetEnabled(0U);
        HAL_Delay(100U);
        Boot_JumpToApplication(APP_BASE);
    }
    else
    {
        BootDisplay_LogColor("UPDATE COMPLETE", BOOT_DISPLAY_COLOR_GREEN);
        BootDisplay_LogColor("APP INVALID", BOOT_DISPLAY_COLOR_RED);
        printf("[BOOT] app NOT valid, staying in bootloader\n");
    }
}

/* -----------------------------------------------------------------------
 * UsbProcessUpdate — Process the update flow for a USB drive that is already
 *                    connected and ready after the silent boot check.
 * ----------------------------------------------------------------------- */
static uint8_t UsbProcessUpdate(void)
{
    UsbFsResult_t mount_result;
    static const char * const update_paths[3] =
    {
        USB_UPDATE_APP_INT_BIN,
        USB_UPDATE_APP_OSPI_BIN,
        USB_UPDATE_MANIFEST
    };
    uint32_t i;
    UsbFsResult_t stat_result;
    uint8_t all_present;
    uint32_t fsize_tmp;
    BootManifest_t manifest;
    BootManifestResult_t mresult;
#ifdef ENABLE_CRYPTO
    boot_sig_payload_t sig_payload;
#endif
    char ver_line[56];

    printf("[UPDATE] USB drive ready, mounting to check for UPDATE directory\n");
    mount_result = UsbFsService_Mount();

    if (mount_result != USB_FS_RESULT_OK)
    {
        BootDisplay_EnsureInit();
        BootDisplay_LogColor("edt EVK070027B BOOTLOADER " BOOT_VERSION,
                             BOOT_DISPLAY_COLOR_BLUE);
        BootDisplay_Fail("USB MOUNT FAILED", 0U);
        printf("[UPDATE] f_mount FAILED result=%u fatfs_err=%lu\n",
               (unsigned int)mount_result,
               (unsigned long)UsbFsService_GetLastError());
        return 1U;
    }

    /* If UPDATE directory is absent this is a plain USB drive — boot normally */
    if (UsbFsService_FileExists(USB_UPDATE_DIR_PATH) != USB_FS_RESULT_OK)
    {
        printf("[UPDATE] UPDATE directory not found, continuing normal boot\n");
        UsbFsService_Unmount();
        UsbMscService_SetEnabled(0U);
        return 0U;
    }

    /* UPDATE directory found — enter update mode */
    BootDisplay_EnsureInit();
    BootDisplay_LogColor("edt EVK070027B BOOTLOADER " BOOT_VERSION,
                         BOOT_DISPLAY_COLOR_BLUE);
    BootDisplay_Log("USB DRIVE DETECTED");
    printf("[UPDATE] USB state: %s\n", UsbMscService_GetStateName());
    printf("[UPDATE] f_mount OK\n");
    BootDisplay_Log("USB DRIVE MOUNTED");
    BootDisplay_Log("CHECKING UPDATE FILES...");

    {
        FATFS  *fs_ptr;
        DWORD   free_clust;
        if (f_getfree("0:", &free_clust, &fs_ptr) == FR_OK)
        {
            printf("[UPDATE] sector=%u bytes  cluster=%u sectors (%lu bytes)\n",
                   (unsigned int)FF_MAX_SS,
                   (unsigned int)fs_ptr->csize,
                   (unsigned long)((uint32_t)fs_ptr->csize * FF_MAX_SS));
        }
    }

    all_present = 1U;
    for (i = 0U; i < 3U; i++)
    {
        stat_result = UsbFsService_FileExists(update_paths[i]);
        printf("[UPDATE] %s -> %s\n",
               update_paths[i],
               (stat_result == USB_FS_RESULT_OK) ? "OK" : "NOT FOUND");
        if (stat_result != USB_FS_RESULT_OK)
        {
            all_present = 0U;
        }
    }

