robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
    if (all_present == 0U)
    {
        BootDisplay_Fail("UPDATE FILES MISSING", 0U);
        printf("[UPDATE] one or more files missing\n");
        return 1U;
    }

    printf("[UPDATE] all files present\n");
    BootDisplay_Log("ALL FILES FOUND");
    BootDisplay_Log("READING MANIFEST...");

    /* Parse manifest and validate its integrity CRC */
    mresult = BootManifest_LoadAndParse(USB_UPDATE_MANIFEST, &manifest);
    if (mresult != BOOT_MANIFEST_OK)
    {
        const char *err_msg = "MANIFEST ERROR";
        if (mresult == BOOT_MANIFEST_ERR_PARSE && manifest.error_msg != NULL)
            err_msg = manifest.error_msg;
        else if (mresult == BOOT_MANIFEST_ERR_INTEGRITY)
            err_msg = "MANIFEST CRC FAILED";
        else if (mresult == BOOT_MANIFEST_ERR_READ)
            err_msg = "MANIFEST READ FAILED";

        BootDisplay_Fail(err_msg, 0U);
        printf("[UPDATE] manifest error=%u\n", (unsigned int)mresult);
        return 1U;
    }

    BootManifest_Print(&manifest);

    /* Validate product and hardware revision */
    if (strcmp(manifest.product, BOOT_EXPECTED_PRODUCT) != 0)
    {
        BootDisplay_Fail("MANIFEST FAIL: PRODUCT", 0U);
        printf("[UPDATE] product=%s expected=%s\n",
               manifest.product, BOOT_EXPECTED_PRODUCT);
        return 1U;
    }
    if (strcmp(manifest.hw_revision, BOOT_EXPECTED_HW_REVISION) != 0)
    {
        BootDisplay_Fail("MANIFEST FAIL: HW", 0U);
        printf("[UPDATE] hw_rev=%s expected=%s\n",
               manifest.hw_revision, BOOT_EXPECTED_HW_REVISION);
        return 1U;
    }

    BootDisplay_Log("MANIFEST OK");

    /* Display version info — strip trailing _x suffix (e.g. V1.R1.P1_b -> V1.R1.P1) */
    {
        char sw_short[20];
        char lib_short[20];
        char *p;

        strncpy(sw_short, manifest.sw_version, sizeof(sw_short) - 1U);
        sw_short[sizeof(sw_short) - 1U] = '\0';
        p = strrchr(sw_short, '_');
        if (p != NULL) *p = '\0';

        strncpy(lib_short, manifest.o3_lib_version, sizeof(lib_short) - 1U);
        lib_short[sizeof(lib_short) - 1U] = '\0';
        p = strrchr(lib_short, '_');
        if (p != NULL) *p = '\0';

        {
            char log_line[32];
            (void)snprintf(log_line, sizeof(log_line), "SW: %s", sw_short);
            BootDisplay_LogColor(log_line, BOOT_DISPLAY_COLOR_BLUE);
            (void)snprintf(log_line, sizeof(log_line), "LIB: %s", lib_short);
            BootDisplay_LogColor(log_line, BOOT_DISPLAY_COLOR_BLUE);
        }

        (void)snprintf(ver_line, sizeof(ver_line), "SW: %s - LIB: %s",
                       sw_short, lib_short);
    }

    /* Validate file sizes against manifest */
    if (UsbFsService_GetFileSize(USB_UPDATE_APP_INT_BIN, &fsize_tmp) == USB_FS_RESULT_OK)
    {
        printf("[UPDATE] %s size=%lu bytes\n", USB_UPDATE_APP_INT_BIN, (unsigned long)fsize_tmp);
        if (fsize_tmp != manifest.app_int.size)
        {
            BootDisplay_Fail("INT FILE SIZE MISMATCH", 0U);
            printf("[UPDATE] expected=%lu actual=%lu\n",
                   (unsigned long)manifest.app_int.size, (unsigned long)fsize_tmp);
            return 1U;
        }
    }
    if (UsbFsService_GetFileSize(USB_UPDATE_APP_OSPI_BIN, &fsize_tmp) == USB_FS_RESULT_OK)
    {
        printf("[UPDATE] %s size=%lu bytes\n", USB_UPDATE_APP_OSPI_BIN, (unsigned long)fsize_tmp);
        if (fsize_tmp != manifest.app_ospi.size)
        {
            BootDisplay_Fail("OSPI FILE SIZE MISMATCH", 0U);
            printf("[UPDATE] expected=%lu actual=%lu\n",
                   (unsigned long)manifest.app_ospi.size, (unsigned long)fsize_tmp);
            return 1U;
        }
    }

#ifdef ENABLE_CRYPTO
    /* Authorization check — manifest.sig must decrypt with a known key.
       Per-file hash verification happens inside the pre-flash CRC loops
       below, folded into the same USB read pass (no extra read). */
    BootDisplay_Log("CHECKING AUTHORIZATION...");
    {
        BootSigResult_t sig_result = BootSig_LoadAndDecrypt(USB_UPDATE_MANIFEST_SIG, &sig_payload);
        if (sig_result != BOOT_SIG_OK)
        {
            const char *sig_err = (sig_result == BOOT_SIG_ERR_MISSING) ? "UNAUTHORIZED: NO SIG" :
                                  (sig_result == BOOT_SIG_ERR_BAD_KEY) ? "UNAUTHORIZED: BAD SIG" :
                                                                          "UNAUTHORIZED: SIG READ FAIL";
            BootDisplay_Fail(sig_err, 0U);
            printf("[UPDATE] manifest.sig FAILED result=%u\n", (unsigned int)sig_result);
            return 1U;
        }
        printf("[UPDATE] manifest.sig OK\n");
    }
#endif

#if BOOT_PRE_FLASH_CRC_CHECK
    /* Pre-flash CRC check of app_int.bin — read from USB and verify before
     * touching any flash.  app_ospi.bin is too large to pre-verify.
     * Under ENABLE_CRYPTO, SHA-256 is accumulated in the SAME read pass to
     * verify manifest.sig's authorization without any extra USB read
     * (see Plan_Cifrado_Bootloader_Consola.txt, NOTA DE RENDIMIENTO). */
    BootDisplay_Log("VERIFYING INT BIN CRC...");
    {
        uint32_t pre_crc = 0U;
        uint32_t pre_off = 0U;
        uint32_t pre_read = 0U;
#ifdef ENABLE_CRYPTO
        sw_sha256_ctx_t sha_ctx;
        sw_sha256_init(&sha_ctx);
#endif

        while (pre_off < manifest.app_int.size)
        {
            uint32_t pre_len = manifest.app_int.size - pre_off;
            if (pre_len > CHUNKED_READ_BLOCK_SIZE)
            {
                pre_len = CHUNKED_READ_BLOCK_SIZE;
            }
            if (UsbReadChunkWithRecovery(USB_UPDATE_APP_INT_BIN, io_buf,
                                         pre_off, pre_len, &pre_read,
                                         "PRE-CRC") != USB_FS_RESULT_OK)
            {
                BootDisplay_Fail("INT BIN READ FAILED", 0U);
                printf("[UPDATE] pre-CRC read FAILED at offset=%lu\n",
                       (unsigned long)pre_off);
                return 1U;
            }
            pre_crc = BootCrc32_Compute(pre_crc, io_buf, pre_read);
#ifdef ENABLE_CRYPTO
            sw_sha256_update(&sha_ctx, io_buf, pre_read);
#endif
            pre_off += pre_read;
        }

        if (pre_crc != manifest.app_int.crc32)
        {
            BootDisplay_Fail("INT BIN CRC MISMATCH", 0U);
            printf("[UPDATE] app_int.bin CRC=%08lX expected=%08lX\n",
                   (unsigned long)pre_crc,
                   (unsigned long)manifest.app_int.crc32);
            return 1U;
        }
#ifdef ENABLE_CRYPTO
        {
            uint8_t digest[32];
            sw_sha256_final(&sha_ctx, digest);
            if (memcmp(digest, sig_payload.app_int_sha256, sizeof digest) != 0)
            {
                BootDisplay_Fail("UNAUTHORIZED: HASH MISMATCH", 0U);
                printf("[UPDATE] app_int.bin SHA-256 mismatch\n");
                return 1U;
            }
        }
#endif
        printf("[UPDATE] app_int.bin pre-CRC OK\n");
        BootDisplay_Log("INT BIN CRC OK");
    }

