robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
    /* Pre-flash CRC check of app_ospi.bin — same approach, slower (~140s). */
    BootDisplay_Log("VERIFYING OSPI BIN CRC...");
    BootDisplay_ShowProgress("VERIFYING OSPI BIN CRC...", 0U, manifest.app_ospi.size);
    {
        uint32_t pre_crc = 0U;
        uint32_t pre_off = 0U;
        uint32_t pre_read = 0U;
#ifdef ENABLE_CRYPTO
        sw_sha256_ctx_t sha_ctx;
        sw_sha256_init(&sha_ctx);
#endif

        while (pre_off < manifest.app_ospi.size)
        {
            uint32_t pre_len = manifest.app_ospi.size - pre_off;
            if (pre_len > CHUNKED_READ_BLOCK_SIZE)
            {
                pre_len = CHUNKED_READ_BLOCK_SIZE;
            }
            if (UsbReadChunkWithRecovery(USB_UPDATE_APP_OSPI_BIN, io_buf,
                                         pre_off, pre_len, &pre_read,
                                         "PRE-CRC") != USB_FS_RESULT_OK)
            {
                BootDisplay_Fail("OSPI BIN READ FAILED", 1U);
                printf("[UPDATE] pre-CRC read FAILED at offset=%lu\n",
                       (unsigned long)pre_off);
                return 1U;
            }
            pre_crc = BootCrc32_Compute(pre_crc, io_buf, pre_read);
#ifdef ENABLE_CRYPTO
            sw_sha256_update(&sha_ctx, io_buf, pre_read);
#endif
            pre_off += pre_read;
            BootDisplay_UpdateProgress("VERIFYING OSPI BIN CRC...",
                                       pre_off, manifest.app_ospi.size);

            /* Throughput telemetry: one line per MB with wall-clock time,
               to pinpoint where USB read time actually goes. */
            if ((pre_off % (1024U * 1024U)) == 0U)
            {
                printf("[PRE-CRC] ospi %lu KB t=%lums\n",
                       (unsigned long)(pre_off / 1024U),
                       (unsigned long)HAL_GetTick());
            }
        }

        if (pre_crc != manifest.app_ospi.crc32)
        {
            BootDisplay_Fail("OSPI BIN CRC MISMATCH", 1U);
            printf("[UPDATE] app_ospi.bin CRC=%08lX expected=%08lX\n",
                   (unsigned long)pre_crc,
                   (unsigned long)manifest.app_ospi.crc32);
            return 1U;
        }
#ifdef ENABLE_CRYPTO
        {
            uint8_t digest[32];
            sw_sha256_final(&sha_ctx, digest);
            if (memcmp(digest, sig_payload.app_ospi_sha256, sizeof digest) != 0)
            {
                BootDisplay_Fail("UNAUTHORIZED: HASH MISMATCH", 1U);
                printf("[UPDATE] app_ospi.bin SHA-256 mismatch\n");
                return 1U;
            }
        }
#endif
        printf("[UPDATE] app_ospi.bin pre-CRC OK\n");
        BootDisplay_Log("OSPI BIN CRC OK");
        BootDisplay_ClearProgress();
    }
#endif

    {
        char date_upper[32];
        uint32_t di;

        strncpy(date_upper, manifest.build_date, sizeof(date_upper) - 1U);
        date_upper[sizeof(date_upper) - 1U] = '\0';
        for (di = 0U; date_upper[di] != '\0'; di++)
        {
            if ((date_upper[di] >= 'a') && (date_upper[di] <= 'z'))
            {
                date_upper[di] = date_upper[di] - ('a' - 'A');
            }
        }
        Boot_ShowProgrammingCountdown(ver_line, date_upper);
    }

    /* Invalidate stored CRCs before touching flash.  This ensures that if
     * power is lost at any point during programming, the next boot will see
     * a valid magic but mismatched CRCs and enter recovery mode.
     * The correct CRCs are written at the end of FlashAppOspi on success.
     * This keeps a single path to recovery (CRC mismatch) regardless of
     * whether the failure is a mid-update power loss or post-update
     * corruption. */
    Boot_StoreAppCrc(0U, 0U, 0U, 0U);

    FlashAppInt(manifest.app_int.crc32);
    FlashAppOspi(manifest.app_ospi.crc32,
                 manifest.app_int.crc32, manifest.app_int.size,
                 manifest.app_ospi.size);
    return 1U;
}

/* -----------------------------------------------------------------------
 * SystemPower_Config
 * ----------------------------------------------------------------------- */
static void SystemPower_Config(void)
{
    if (HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY) != HAL_OK)
    {
        Error_Handler();
    }
}

/* -----------------------------------------------------------------------
 * SystemClock_Config
 * ----------------------------------------------------------------------- */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /* Voltage scale 1 is required to run SYSCLK at 160 MHz (mirrors the
       application project). */
    if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSIState       = RCC_HSI_ON;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMBOOST  = RCC_PLLMBOOST_DIV2;
    RCC_OscInitStruct.PLL.PLLM       = 5;
    RCC_OscInitStruct.PLL.PLLN       = 64;
    RCC_OscInitStruct.PLL.PLLP       = 10;
    RCC_OscInitStruct.PLL.PLLQ       = 2;
    RCC_OscInitStruct.PLL.PLLR       = 2;
    RCC_OscInitStruct.PLL.PLLRGE     = RCC_PLLVCIRANGE_0;
    RCC_OscInitStruct.PLL.PLLFRACN   = 0;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK  | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2  |
                                       RCC_CLOCKTYPE_PCLK3;
    /* SYSCLK from PLL1R = 160 MHz (was HSI 16 MHz). Mandatory for USB host
       DMA mode (usbh_conf.c): the OTG core's DMA needs a much faster AHB
       than 16 MHz — with HSI the device connected but never enumerated.
       At 16 MHz in slave mode the CPU could not service HS bulk FIFOs
       (~20-30 KB/s + periodic wedged BOT recovery). OSPI (PLL1) and LTDC
       (PLL3) kernels are unaffected by this switch; SWV viewers must be
       reconfigured for a 160 MHz core clock. */
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB3CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
    {
        Error_Handler();
    }
}

/* -----------------------------------------------------------------------
 * MX_GPIO_Init
 * ----------------------------------------------------------------------- */
static void MX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOI_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    HAL_GPIO_WritePin(FS_PW_SW_GPIO_Port, FS_PW_SW_Pin, GPIO_PIN_SET);
    GPIO_InitStruct.Pin   = FS_PW_SW_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(FS_PW_SW_GPIO_Port, &GPIO_InitStruct);

    HAL_GPIO_WritePin(BOOT_LED_GPIO_Port, BOOT_LED_Pin, GPIO_PIN_RESET);
    GPIO_InitStruct.Pin   = BOOT_LED_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(BOOT_LED_GPIO_Port, &GPIO_InitStruct);
}

/* -----------------------------------------------------------------------
 * Error_Handler
 * ----------------------------------------------------------------------- */
void Error_Handler(void)
{
    __disable_irq();
    while (1) {}
}
